# GetZoomCorners Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView..::..GetZoomCorners Method
UIView Class See Also
---
Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<XYZ> GetZoomCorners()
```

Visual Basic
---
```text
Public Function GetZoomCorners As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetZoomCorners()
```

# See Also
UIView Class
Autodesk.Revit.UI Namespace